## =================================================
## DataFrame 인스턴스/객체 생성 - 다양한 방식 SR,SR,...
## =================================================
##-> 모듈 로딩
## -------------------------------------------------
import pandas as pd


## -------------------------------------------------
##-> 데이터 준비
## -------------------------------------------------
nameSR = pd.Series(['홍길동','베트맨','마징가'])
ageSR  = pd.Series([100, 200, 99])


## -------------------------------------------------
## 함수기능 : DataFrame 객체의 속성 출력 기능
## 함수이름 : print_attr
## 매개변수 : df       - 데이터프레임 인스턴스/객체
##           df_name  - 데이터프레임 인스턴스/객체 이름
## 반환결과 : 없음
## -------------------------------------------------
def print_attr(df, df_name):
    print(f'\n---[{df_name} 속성 읽기]---')
    print(f'인덱스 : {df.index}')
    print(f'컬럼즈 : {df.columns}')
    print(f'데이터 :\n{df.values}, {type(df.values)}')
    print(f'형  태 : {df.shape}')      ## 2차원으로 원소 수 반환
    print(f'차  원 : {df.ndim}차원')    ## 2차원
    print(f'타  입 :\n{df.dtypes}')    ## 컬럼별 타입
    print(f'데이터프레임 :\n{df}')


## -------------------------------------------------
##-> DataFrame으로 저장 
## -------------------------------------------------
##-> 2개 Series로 DataFrame 변환 

##-> list/tuple 타입은 가로로 즉, 행단위로 저장 
dataDF1 = pd.DataFrame([nameSR, ageSR])

##-> Key:Value형태의 Dict 타입은 Key가 컬럼명, 세로로 즉 컬럼단위 저장
dataDF2 = pd.DataFrame( {'name':nameSR, 'age':ageSR}  )


## -------------------------------------------------
##-> DataFrame 인스턴스의 속성 읽기
## -------------------------------------------------
##-> 데이터 확인
print_attr(dataDF1, 'dataDF')
print_attr(dataDF2, 'dataDF')
