## =================================================
## DataFrame 인스턴스/객체 생성 - 다양한 방식
## =================================================
##-> 모듈 로딩
## -------------------------------------------------
import pandas as pd


## -------------------------------------------------
##-> 데이터 준비
## -------------------------------------------------
jumsu=[[99, 77, 55], 
       [77, 88, 66]]

##-> 행인덱스
idx = ['0번','1번']

##-> 열인덱스 
cols = ['국어','체육','과학']


## -------------------------------------------------
## 함수기능 : DataFrame 객체의 속성 출력 기능
## 함수이름 : print_attr
## 매개변수 : df       - 데이터프레임 인스턴스/객체
##           df_name  - 데이터프레임 인스턴스/객체 이름
## 반환결과 : 없음
## -------------------------------------------------
def print_attr(df, df_name):
    print(f'\n---[{df_name} 속성 읽기]---')
    print(f'인덱스 : {df.index}')
    print(f'컬럼즈 : {df.columns}')
    print(f'데이터 :\n{df.values}, {type(df.values)}')
    print(f'형  태 : {df.shape}')      ## 2차원으로 원소 수 반환
    print(f'차  원 : {df.ndim}차원')    ## 2차원
    print(f'타  입 :\n{df.dtypes}')    ## 컬럼별 타입
    print(f'데이터프레임 :\n{df}')


## -------------------------------------------------
##-> DataFrame으로 변환 저장
## -------------------------------------------------
##-> 데이터, 행인덱스
dataDF1 = pd.DataFrame(jumsu, idx)

##-> 데이터, 행인덱스, 열인덱스
dataDF2 = pd.DataFrame(jumsu, idx, cols)

##-> 데이터, 행인덱스, 열인덱스, 타입즈
dataDF3 = pd.DataFrame(jumsu, idx, cols, dtype='int8')


## -------------------------------------------------
##-> DataFrame 인스턴스의 속성 읽기
## -------------------------------------------------
##-> Data, index
print_attr(dataDF1, 'dataDF1')


##-> Data, index, columns
print_attr(dataDF2, 'dataDF2')


##-> Data, index, columns, dtype
print_attr(dataDF3, 'dataDF3')