## =================================================
## DataFrame 인스턴스/객체 생성 - 다양한 방식 File
## =================================================
##-> 모듈 로딩
## -------------------------------------------------
import pandas as pd


## -------------------------------------------------
##-> 데이터 준비
## -------------------------------------------------
DATA_FILE = '../Data/test.json'


## -------------------------------------------------
## 함수기능 : DataFrame 객체의 속성 출력 기능
## 함수이름 : print_attr
## 매개변수 : df       - 데이터프레임 인스턴스/객체
##           df_name  - 데이터프레임 인스턴스/객체 이름
## 반환결과 : 없음
## -------------------------------------------------
def print_attr(df, df_name):
    print(f'\n---[{df_name} 속성 읽기]---')
    print(f'인덱스 : {df.index}')
    print(f'컬럼즈 : {df.columns}')
    print(f'데이터 :\n{df.values}, {type(df.values)}')
    print(f'형  태 : {df.shape}')      ## 2차원으로 원소 수 반환
    print(f'차  원 : {df.ndim}차원')    ## 2차원
    print(f'타  입 :\n{df.dtypes}')    ## 컬럼별 타입
    print(f'데이터프레임 :\n{df}')


## -------------------------------------------------
##-> DataFrame으로 변환 저장
## -------------------------------------------------
##-> json => DataFrame으로 변환 저장 
jsonDF = pd.read_json(DATA_FILE)


## -------------------------------------------------
##-> DataFrame 인스턴스의 속성 읽기
## -------------------------------------------------
##-> 변환 저장한 json 데이터 확인
print_attr(jsonDF, 'jsonDF')