## =====================================================================
##          Tkinter font
## =====================================================================
## - 한글 폰트명도 인식 가능, OS가 한글 이름 지원하지 않으면 영어식 이름
##
## - 사용법
##   from tkinter import font 
##   font.Font(family="맑은 고딕", size=14, weight="bold", underline=1)
##
## - 속성 
##   * family	    폰트 이름
##   * size	        폰트 크기       (pt 단위)
##   * weight	    굵기            "normal" / "bold"
##   * slant	    기울임          "roman" / "italic"	
##   * underline	밑줄 여부        0 / 1	
##   * overstrike	취소선 여부      0 / 1	
## =====================================================================
## ---------------------------------------------------------------------
## 모듈로딩
## ---------------------------------------------------------------------
import tkinter as tk
from tkinter import font 


## ---------------------------------------------------------------------
## Window 인스턴스 생성 및 폰트 정보 추출 
## ---------------------------------------------------------------------
##- Main Window 인스턴스 생성 및 설정
root = tk.Tk()
root.title("Tkinter 폰트")
root.geometry("800x300")   ## 모니터 상에 Window 띄우는 위치 설정 X -> 알아서 띄워줌

##- OS 지원하는 폰트 정보 조회 및 출력
fonts = sorted(font.families())
for font in fonts:
    print(f'{font}')

## ---------------------------------------------------------------------
## UI 인스턴스 생성 및 설정
## ---------------------------------------------------------------------
##- Listbox 인스턴스 생성 및 설정
fontLBX = tk.Listbox(root, height=20, width=30)
fontLBX.pack(side='left', fill='y', padx=(10,5), pady=10)
## - List에 폰트 이름 추가
for font in fonts: fontLBX.insert(tk.END, font)

##- Label 인스턴스 생성 및 설정
previewLB = tk.Label(root, text="선택 폰트 미리보기", font=("Arial", 12))
previewLB.pack(side='left', padx=(5,10), pady=10)


## ---------------------------------------------------------------------
## 이벤트 처리 핸들러 정의
## ---------------------------------------------------------------------
## 핸들러 기능 : 리스트박스에 선택한 경우 처리
## 핸들러 이름 : show_front
## 매개   변수 : event - 핸들러에 연결된 이벤트
## 반환   결과 : -
##              선택한 폰트를 미리보기 레이블에 적용 설정
## ---------------------------------------------------------------------
def show_font(event):
    ## 리스트박스에서 선택한 것 가져오기
    seletFont = fontLBX.get(fontLBX.curselection())

    ## 선택한 폰트를 미리보기 레이블에 적용 설정
    ## Widget 인스턴스.config(옵션/속성명=새로운값)
    previewLB.config(font=(seletFont, 16))
    previewLB.config(text=f"Sample - {seletFont}")

## ---------------------------------------------------------------------
## UI 인스턴스 이벤트 설정
## ---------------------------------------------------------------------
## ListBox에서 발생하는 Event와 핸들러 연결
fontLBX.bind("<<ListboxSelect>>", show_font)


## ---------------------------------------------------------------------
## Window 이벤트 루프
## ---------------------------------------------------------------------
root.mainloop()
