## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## - 컨테이너 위젯 : 여러개의 Widget을 담을 수 있는 Widget
## - 대표   위젯 : Frame, TopLevel
## - Frame 위젯 : 포함된 Widget들의 부모가 됨
##      * 사용 : Frame 인스턴스 생성
##          UI Widget 인스턴스 생성 시 Frame 인스턴스를 master로 설정
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성
window=tkinter.Tk()
window.title("** Container Widget - Frame **")
window.geometry("900x400")


## --------------------------------------------------------------------
##- Widget 인스턴스 생성 및 설정
## --------------------------------------------------------------------
## - ID 라벨과 입력필드
idLB = tkinter.Label(window, text="ID")
idENT = tkinter.Entry(window)
idLB.pack(anchor='w')
idENT.pack(anchor='w', fill='x')


## - PW 라벨과 입력필드
pwFR = tkinter.Frame(window, bg='lightyellow', bd=2, relief='solid')
pwLB = tkinter.Label(pwFR, text="PW")
pwENT = tkinter.Entry(pwFR)

## - Frame 자식 Widget 배치
pwFR.pack()
pwLB.grid(row=0, column=0)
pwENT.grid(row=1, column=2)


## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()