## ===================================================================
##                  Python 표준 라이브러리 통계 모듈
## ===================================================================
## 함수의 매개변수들 의미
## 
## -  *변수명 :  0개 ~ n개 가변인자(positional-only) 매개변수
## - **변수명 :  0개 ~ n개 키워드=값 형태(keyword-only) 매개변수
## - /       :  앞쪽 인자들은 위치로만 전달 가능한(positional-only) 매개변수들
## - *       :  뒤쪽 인자들은 이름으로만 전달 가능한(keyword-only) 매개변수들
## - 실제 데이터에 가장 잘 맞도록(a, b를 최소제곱으로 추정)하는 과정
## ===================================================================

## -------------------------------------------------------------------
## 위치 전용 인자 (positional-only) 함수
## -------------------------------------------------------------------
def f_posonly(a, b, /):
    return a + b


## -------------------------------------------------------------------
## 위치 전용 인자 (keyword-only) 함수
## -------------------------------------------------------------------
## * 뒤에 있는 매개변수에 데이터 전달 시 b=데이터, c=데이터
def f_keyword(a, *, b, c): ## *뒤에 변수명이 없어서 가변인자는 아님.
    return a + b + c

## -------------------------------------------------------------------
## 혼합 전용 인자 (keyword + positional) 함수
## -------------------------------------------------------------------
def f_mixed(a, /,  *, b, c):
    return a + b + c




## -------------------------------------------------------------------
## def f_posonly(a, b, /) : 위치로만 전달 가능
## -------------------------------------------------------------------
print(f"f_posonly(10, 20)      호출 : {f_posonly(10, 20)}")
# print(f"f_posonly(a=10, b=20)  호출 : ERROR {f_posonly(a=10, b=20)}")     ## / 기준으로 앞에 매개변수는 위치로만 전달 가능함 
# print(f"f_posonly(a=10, b=20)  호출 : ERROR")
print()

## -------------------------------------------------------------------
## def f_keyword(a, *, b, c) : 매개변수는 이름으로만 전달 가능
## -------------------------------------------------------------------
print(f"f_keyword (a=10, b=20, c=30) 호출 : {f_keyword(a=10, b=20, c=30)}") 
print(f"f_keyword (10, b=20, c=30)   호출 : {f_keyword(10, b=20, c=30)}")   
# print(f"f_keyword (10, 20, 30)   호출 : {f_keyword(10, 20, 30)}")           ## * 기준으로 뒤에 매개변수는 이름으로만 전달 가능함
# print(f"f_keyword (10, 20, 30)   호출 : ERROR")  
print()


## -------------------------------------------------------------------
## def f_mixed(a, /,  *, b, c):
#   위치방식 전달 <=     => 키워드 방식 전달
## -------------------------------------------------------------------
#print(f"f_mixed (a=10, b=20, c=30)   호출 : ERROR {f_mixed(a=10, b=20, c=30)}") 
print(f"f_mixed (a=10, b=20, c=30)   호출 : ERROR") 
print(f"f_mixed (10, b=20, c=30)     호출 : {f_mixed(10, b=20, c=30)}") 
print(f"f_mixed (10, 20, 30)     호출 : {f_mixed(10, 20, 30)}")             ## 위치 전달은 1개인데, 왜 3개를 줬냐? 하면서 에러 발생.

