-- ===========================================================
-- 제약조건 : 컬럼 데이터 추가에 대한 다양한 조건들
--           (1) PK & FK : 테이블 간의 관계 설정
--               PK - 부모테이블    FK - 자식테이블
-- ===========================================================

-- ===========================================================
-- DB 선택 및 TB 생성
-- ===========================================================
-- DB 선택
use doitsql;

-- TB 생성
CREATE TABLE parent ( col_1 Int PRIMARY KEY);

CREATE TABLE child (col_1 Int ,
                    FOREIGN KEY(col_1) REFERENCES parent(col_1));

-- ===========================================================
-- 데이터 추가 : Parent가 존재하지 않는 FK는 child에 추가 X
-- ===========================================================
-- Parent TB에 데이터 추가
INSERT INTO parent VALUES (1),(2),(12);
-- Child TB에 데이터 추가
INSERT INTO child VALUES (1);


-- ===========================================================
-- 데이터 삭제 : 
-- ===========================================================
-- Parent에서 삭제 : Delete From 테이블이름 Where 조건;
## DELETE FROM parent where col_1 = 1; # error 발생: 자식이 있으니까. 참조하고 있는 애가 있으니까 삭제 안됨
DELETE FROM parent where col_1 = 2;

-- Child에서 삭제
DELETE FROM child WHERE col_1 = 1;
DELETE FROM parent where col_1 = 1;

-- ===========================================================
-- 데이터 조회
-- ===========================================================
SELECT * FROM parent;
SELECT * FROM child;