-- =========================================================
-- JOIN : 테이블 조합으로 원하는 데이터 추출/선택
--        종류 : 내부(INNER) / 외부(OUTER)
-- =========================================================
-- DB 선택 및 TB 생성
-- =========================================================
-- DB 선택
use sakila;

-- TB 생성
CREATE TABLE A(
    id int PRIMARY KEY,
    ename char(3) not null,
    mgr CHAR(3) not null
);

CREATE TABLE B(
    id int PRIMARY KEY,
    kname CHAR(3) NOT NULL
);
-- =========================================================
-- TB 데이터 추가
-- =========================================================
INSERT INTO A
VALUES (1,'AAA','Top'), (2,'BBB','AAA'), (3,'CCC','BBB'),
       (11,'111','CCC'), (22,'222','111'), (33,'333','111');

INSERT INTO B
VALUES (1,'가'), (2, '나'), (3, '다'),
       (4, '라라'), (5, '마마마'), (6, '바바바');

-- =========================================================
-- 데이터 조회
-- =========================================================
-- [전체 조회]
SELECT * FROM A;
SELECT * FROM B;

-- [내부조인] / 교집합과 동일
-- [내부 조인]  / Equi Join : 두개 TB에 기준 컬럼의 값이 동일한 것만 선택
SELECT A.id, A.ename, B.kname 
FROM A INNER JOIN B
ON A.id = b.id;

-- A의 ID가 22보다 큰거. BUT, 내부조인이니까. 22보다 큰게 값을 채움(나도 뭔솔인지 모름)
-- [내부 조인] : Non-Equi Join
SELECT *
FROM A INNER JOIN B
ON A.id > 22;  